import input.bu_bu_gao
import input.nao_bai_jin
import input.the_elder
import model.cpm2
import model.gpt3
import bminf

cpm2 = bminf.models.CPM2()
text = """
第四章 当众打脸": "话音落下，大门方向就传来了高跟鞋踩在地板上的哒哒声。\n王野扭头一看，一双白皙的大长腿映入眼帘。\n再往上一看，紧身职业装包裹着完美身材。绝美的容貌，乌黑的长发。气质高贵无比！\n那双大长腿迈着优雅的步伐走来，每一步都像是踩在男人们的心里，让人蠢蠢欲动。\n所有人都看得呆了，这位，就是云城第一商界女精英……夏清心。\n美貌与智慧并存的顶级名媛，旗下资产千亿。\n苏远桥看到是夏清心过来，急忙起身要去迎接。\n但夏清心在众人的注视之下，径直走向了杨俊生。\n杨俊生心里顿时激动的扑通扑通的，因为他以为，夏清心这是为自己而来。\n“夏董，久仰您的大名，今日一见，果然和传说中的一样，美艳无双啊！”杨俊生伸出手，想要和夏清心打招呼。\n夏清心没有理他，而是低头看了看地上被自己高跟鞋踩着的支票。\n随后抬手，一巴掌打在了杨俊生的脸上。\n“啪！”\n清脆的声音，在整个大厅里回荡。\n这一瞬间，全场安静了。\n所有人都懵了，杨俊生更懵。\n捂着红肿的脸，委屈的向夏清心问道：“夏董，您这是做什么啊？我没有什么地方得罪您吧！”\n夏清心没有回答，而是反手又一巴掌呼在他脸上。\n“啪！”\n又是一声清脆的巨响。\n夏清心打完，没有任何解释，随后扭头看向了王野，“小师弟，有师姐在，谁也不能欺负你！”\n说完，还十分温柔的摸了摸王野的头。\n王野偏了一下头，憨憨的笑道：“师姐，这样不好啊！我都是成年人了。”\n“长大了是吧？不把师姐放在眼里了？”夏清心假装生气的戳了戳王野的头。\n其他人都看得呆了，谁也没想到这小道士，竟然是云城第一女企业家夏清心的师弟！\n“苏老先生，我师弟王野的聘礼已经准备好了。苏家的经济危机，我可以解决。”夏清心随后看向苏远桥说道。\n苏远桥还在发愣呢，一队身穿红色旗袍的高挑美女，就手捧着一个个的盒子走进了大厅。\n最前面，还有一个六十来岁的唐装男人高声开口道：\n“王家聘礼清单：”\n“金如意一对，玉如意一对。”\n“24k纯金金饰一套。”\n“十克拉全美方钻一枚。”\n“……”\n“礼金八百八十八万。”\n这一套豪华聘礼，看得众人是眼花缭乱的。\n规格如此之高，就是在整个云城都极其少见。\n“这些聘礼，怕不是要花上五千万吧！”\n“五千万？我看不止，就那枚钻戒，就上千万了。”\n“对，还有那两对如意，好像都是有些年代的东西，单价也不低于一百万。整体加起来，怕是有一个亿。”\n“果然是夏董，出手就是不一样。”\n“师弟，师姐准备的这份聘礼，你还满意吗？”夏清心柔声问道。\n王野想了想，带头道：“满意。不过师姐，这些聘礼太贵重了吧！今后我挣了钱，会还给你的。”\n此时的王野还不知道，一个亿意味着什么。若是他自己来挣，恐怕这辈子都还不上。\n“你个没良心的臭师弟，师姐的钱就是你的，还用还吗？”夏清心一巴掌打在了王野的脸上。\n当然，这一巴掌和没有任何杀伤力，反倒是让人看了有种很亲昵的感觉。\n此刻，所有人都在安安静静的看着夏清心的表演。\n杨俊生捂着两个巴掌印的脸，心中又气又恨，但是又不敢怎么样。\n夏清心在云城，那可是大人物。杨家，还没有实力和夏清心对抗。这两巴掌，现在挨了就是挨了。\n只有以后再找机会，把这仇给报了。\n“对了，这间酒楼，送你当订婚礼物。”夏清心补充一句。\n订婚礼物？\n夏清心的话，又把众人给惊到了。\n“天晟酒楼当订婚礼物？没搞错吧，这可是价值十个亿的大酒楼啊！”\n“对啊，果然是云城第一女企业家夏清心，出手真阔绰。”\n“这是重点吗？重点是她把酒楼送给师弟好吧！这对师弟，也太好了吧！”\n“没错，这关系，太不简单了。”\n杨俊生已经完全傻眼了，王野是夏清心师弟也就算了。夏清心竟然还对他这么好？他们真的是单纯的师姐和师弟的关系吗？\n自己刚才那样羞辱王野，那夏清心会善罢甘休吗？想到这里，杨俊生心里害怕得直发抖。\n“师姐，这酒楼我就不要了吧！”王野推辞道。\n“闭嘴！”夏清心直接训斥，“师姐的话，你照做就行。”\n面对如此霸道的大师姐，王野也是很无奈。谁让自己，只是个小师弟呢？\n“苏老先生，婚约在，聘礼也准备好了。我作为王野的家长，想跟您商量一下他们两人的婚事，不知道您有什么看法？”夏清心客气的向苏远桥问道。\n“老朽没有什么看法，一切全凭夏总安排。”\n在夏清心面前，苏远桥哪里还敢有什么看法。\n“那好，正式婚礼，就定在一个月之后。”夏清心霸气的开口。\n“我不同意。”\n苏婉卿高亢的声音响起。\n“我不会跟他结婚，这婚约，不能算。”\n苏婉卿拿过爷爷手里的婚约走向王野，面色冷酷，“王野道长，现在是新世纪了，没有什么一纸婚约的事情！我们互不相识，结婚没有好处，请走吧！”\n王野闻言，心里忽然一冷。既然苏婉卿不愿意，那或许真不该强求。毕竟强扭的瓜，不甜。\n关于自己的身世，还是另寻办法吧！\n“好吧，那有缘再会，苏小姐！希望苏家不会因此，遭受天道谴责。”王野答应一声，从苏婉卿手里接过婚约，转身离开。\n“师弟……”夏清心立马想要阻拦，自己都开口了，苏家不同意婚约，那不是打自己的脸？\n不过这个时候，主位上的苏远桥忽然痛苦的尖叫一声一声。\n随后口吐白沫，一头栽倒在地上。\n“爷爷，你怎么了爷爷？”\n苏婉卿看到苏远桥一头栽倒，立马就慌了起来。\n现场的宾客，也顿时乱作一团。\n今天可是苏远桥的七十大寿，要是他就这么走了，事情可就闹大了。\n王野回头定睛一看，立马就发现了端倪。\n原来这苏老爷子本就有气血不足，血脉迟缓的症状。再加上胸前那颗舍利子，吸收了他大量的元气，这才导致他身体急剧变化，脑供血不足，一下栽倒在地。\n“医生，医生，快叫医生。
主角是<span>
主角在<span>做了<span>,结果<span>
"""

for result in cpm2.fill_blank(text,
                              top_p=1.0,
                              top_n=10,
                              temperature=0.9,
                              frequency_penalty=0,
                              presence_penalty=0,
                              max_tokens=32
                              ):
    value = result["text"]
    text = text.replace("<span>", "\033[0;32m" + value + "\033[0m", 1)
print(text)
